app/controllers/projects_controller.rb

SELECT * FROM `projects`
---
  def index
    @projects = Project.all

INSERT INTO `projects` (`name`, `updated_at`, `created_at`) VALUES(NULL, '2009-04-19 22:04:26', '2009-04-19 22:04:26')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 953125641)
---
  def update
    @project = Project.find(params[:id])